In [45]:
import pandas as pd

df = pd.read_csv('input.csv', delimiter=',')

In [46]:
df

       first_name  last_name
0           Louis     Nguyen
1          Andrew      Brown
2         Zachary  Rodriguez
3           Stacy   Martinez
4           Susan      Perry
...           ...        ...
499995    Candice     Oliver
499996      Brian   Anderson
499997      Jerry    Michael
499998       Kara   Martinez
499999    Richard       Hall

[500000 rows x 2 columns]

       first_name last_name
230491       Dana    Abbott
214695     Donald    Abbott
466893    Crystal    Abbott
420478     Rodney    Abbott
331035       Ryan    Abbott
...           ...       ...
396295     Robert    Zuniga
243710    Tiffany    Zuniga
414036       Lisa    Zuniga
206521       Ryan    Zuniga
317668    Cameron    Zuniga

[500000 rows x 2 columns]

In [47]:
df.drop_duplicates()

       first_name  last_name
0           Louis     Nguyen
1          Andrew      Brown
2         Zachary  Rodriguez
3           Stacy   Martinez
4           Susan      Perry
...           ...        ...
499980     Austin    Alvarez
499982      Kerri     Farley
499994    Russell     Bowers
499995    Candice     Oliver
499997      Jerry    Michael

[206226 rows x 2 columns]

In [60]:
df.sort_values(by="last_name")

       first_name last_name
230491       Dana    Abbott
46689      Dakota    Abbott
37195        Jill    Abbott
489205      Emily    Abbott
37092     Phyllis    Abbott
...           ...       ...
211685     Ernest    Zuniga
295687    Michael    Zuniga
88617       Aaron    Zuniga
296487     Curtis    Zuniga
317668    Cameron    Zuniga

[500000 rows x 2 columns]

In [49]:
df[df['last_name'].str.startswith('S')]

       first_name  last_name
10        Melanie      Smith
16         Joanne   Stephens
18       Jennifer    Sanders
27         Alicia    Sanders
42         Amanda  Schneider
...           ...        ...
499846      Jesse    Simmons
499854      Sarah    Sanders
499904    Kathryn    Schmidt
499977       Todd    Sanchez
499993   Jennifer    Schmidt

[42699 rows x 2 columns]

In [50]:
type(df[df['last_name'].str.startswith('S')])

pandas.core.frame.DataFrame

In [51]:
df.to_csv('output.csv')